Repository: chsxf/mfx
Catalog: framework/messages/*/LC_MESSAGES/mfx.po
Languages: fr_fr

source: %d error has occured:
fr_fr: %d erreur est survenue :

source: Close
fr_fr: Fermer

source: PHP version
fr_fr: Version de PHP

source: Duration
fr_fr: Durée

source: Operation count
fr_fr: Nombre d'opérations

source: Memory peak usage
fr_fr: Pic d'utilisation mémoire

source: %s bytes
fr_fr: %s octets

source: %s%% of allowed memory
fr_fr: %s%% de la mémoire autorisée

source: Memory real peak usage
fr_fr: Pic réel d'utilisation mémoire

source: Milliseconds
fr_fr: Millisecondes

source: Memory usage
fr_fr: Utilisation de la mémoire

source: Real memory usage
fr_fr: Utilisation réelle de la mémoire

source: Profiling timeline (bytes over milliseconds)
fr_fr: Chronologie du profilage (octets par millisecondes)

source: Show / hide profiler
fr_fr: Afficher / masquer le profileur

source: Profiling results
fr_fr: Résultats du profilage

source: Field values cannot be altered.
fr_fr: Les valeurs des champs ne peuvent être modifiées.

source: References to other fields must be provided as a Field instance or an array containing only instances of this class.
fr_fr: Les références vers d'autres champs doivent être fournies grâce à une instance de Field ou à un tableau ne contenant que des instances de cette classe.

source: Field name cannot be empty.
fr_fr: Le nom du champ ne doit pas être vide.

source: Expected string as the field name.
fr_fr: Le nom du champ doit être une chaîne de caractères.

source: Value for repeatable field '%s' must be an array.
fr_fr: La valeur du champ répétable '%s' doit être un tableau.

source: The field '%s' is required.
fr_fr: Le champ '%s' est requis.

source: The field '%s' at index %d is required.
fr_fr: Le champ '%s' à l'index %d est requis.

source: The field '%s' cannot be repeated more than %d times.
fr_fr: Le champ '%s' ne peut être répété plus de %d fois.

source: The field '%s' does not contain a valid date.
fr_fr: Le champ '%s' ne contient pas une date valide.

source: The field '%s' at index %d does not contain a valid date.
fr_fr: Le champ '%s' à l'index %d ne contient pas une date valide.

source: The field '%s' does not contain a valid time.
fr_fr: Le champ '%s' ne contient pas une heure valide.

source: The field '%s' at index %d does not contain a valid time.
fr_fr: Le champ '%s' à l'index %d ne contient pas une heure valide.

source: yyyy/mm/dd
fr_fr: dd/mm/aaaa

source: The field '%s' at index %d is not a valid email address.
fr_fr: Le champ '%s' à l'index %d ne contient pas une adresse email valide.

source: The field '%s' is not a valid email address.
fr_fr: Le champ '%s' ne contient pas une adresse email valide.

source: The field '%s' at index %d is not an integer.
fr_fr: Le champ '%s' à l'index %d ne contient pas un entier.

source: The field '%s' at index %d is not a stricly positive integer.
fr_fr: Le champ '%s' à l'index %d ne contient pas un entier strictement positif.

source: The field '%s' at index %d is not a positive or zero integer.
fr_fr: Le champ '%s' à l'index %d ne contient pas un entier positif ou égal à zéro.

source: The field '%s' at index %d is not a stricly negative integer.
fr_fr: Le champ '%s' à l'index %d ne contient pas un entier strictement négatif.

source: The field '%s' at index %d is not a negative or zero integer.
fr_fr: Le champ '%s' à l'index %d ne contient pas un entier négatif ou égal à zéro.

source: The field '%s' is not an integer.
fr_fr: Le champ '%s' ne contient pas un entier.

source: The field '%s' is not a stricly positive integer.
fr_fr: Le champ '%s' ne contient pas un entier strictement positif.

source: The field '%s' is not a positive or zero integer.
fr_fr: Le champ '%s' ne contient pas un entier positif ou égal à zéro.

source: The field '%s' is not a stricly negative integer.
fr_fr: Le champ '%s' ne contient pas un entier strictement négatif.

source: The field '%s' is not a negative or zero integer.
fr_fr: Le champ '%s' ne contient pas un entier négatif ou égal à zéro.

source: '%s' is not a valid value for the '%s' field at index %d.
fr_fr: '%s' n'est pas une valeur valide pour le champ '%s' à l'index %d.

source: '%s' is not a valid value for the '%s' field.
fr_fr: '%s' n'est pas une valeur valide pour le champ '%s'.

source: A class is already registered for the field type.
fr_fr: Une classe est déjà enregistrée pour ce type de champ.

source: The '%%s' field must reprensent a non-existing entry in the '%s' table (matched on the '%s' field).
fr_fr: Le champ '%%s' doit représenter une entrée n'existant pas dans la table '%s' (comparée dans le champ '%s').

source: The '%%s' field must reprensent an existing entry in the '%s' table (matched on the '%s' field).
fr_fr: Le champ '%%s' doit représenter une entrée existant dans la table '%s' (comparée dans le champ '%s').

source: or
fr_fr: ou

source: The field '%%s' must match the value of the field '%s'.
fr_fr: Le champ '%%s' doit correspondre à la valeur du champ '%s'.

source: and
fr_fr: et

source: The field '%%s' must match the value of the fields %s.
fr_fr: Le champ '%%s' doit correspondre à la valeur des champs %s.

source: The '%s' field does not contain an existing path.
fr_fr: Le champ '%s' ne contient pas un chemin existant.

source: The '%s' field does not match the specified regular expression.
fr_fr: Le champ '%s' ne correspond pas l'expression régulière spécifiée.

source: The string in field '%%s' must contain exactly %d characters.
fr_fr: Le chaîne dans le champ '%%s' doit contenir exactement %d caractères.

source: The string in field '%%s' must contain between %d and %d characters (inclusive).
fr_fr: Le chaîne dans le champ '%%s' doit contenir entre %d et %d caractères (inclus).

source: The string in field '%%s' must contain at least %d characters.
fr_fr: Le chaîne dans le champ '%%s' doit contenir au moins %d caractères.

source: The string in field '%%s' must contain at most %d characters.
fr_fr: Le chaîne dans le champ '%%s' doit contenir au plus %d caractères.

source: The field '%s' does not contain a word.
fr_fr: Le champ '%s' ne contient pas un mot.

source: The field '%s' does not contain a lower case word.
fr_fr: Le champ '%s' ne contient pas un mot en minuscules.

source: The field '%s' does not contain an upper case word.
fr_fr: Le champ '%s' ne contient pas un mot en majuscules.

source: The field '%%s' does not equal the value '%s'.
fr_fr: Le champ '%%s' ne correspond pas à la valeur '%s'.

source: The field '%%s' is required when the field '%s' is provided.
fr_fr: Le champ '%%s' est requis quand le champ '%s' est fourni.

source: The field '%%s' is required when the fields %s are provided.
fr_fr: Le champ '%%s' est requis quand les champs %s sont fournis.

source: The field '%s' must contain unique values.
fr_fr: Le champ '%s' doit contenir des valeurs uniques.

source: Wrong SQL update file path for DatabaseUpdater '%s'.
fr_fr: Le chemin du fichier SQL de mise à jour pour le DatabaseUpdater ‘%s’ est incorrect.

source: The SQL update file should start with a VERSION token (updater key: '%s').
fr_fr: Le fichier SQL de mise à jour devrait débuter avec un marqueur VERSION (clé d’actualiseur : ‘%s’).

source: An error has occured while processing DatabaseUpdater '%s'.
fr_fr: Une erreur est survenue pendant l’exécution du DatabaseUpdater ‘%s’.
